FastTurtle7892/UWB_Phase_Correction/API/nRF52840-DK/pratice.c
    /* Configure the TX spectrum parameters (power, PG delay and PG count) */
    dwt_configuretxrf(&txconfig_options);

    /* Apply default antenna delay value. See NOTE 1 below. */
    dwt_setrxantennadelay(RX_ANT_DLY);
    dwt_settxantennadelay(TX_ANT_DLY);

    /* Next can enable TX/RX states output on GPIOs 5 and 6 to help debug, and also TX/RX LEDs
     * Note, in real low power applications the LEDs should not be used. */
    dwt_setlnapamode(DWT_LNA_ENABLE | DWT_PA_ENABLE);
    //dwt_setleds(DWT_LEDS_ENABLE | DWT_LEDS_INIT_BLINK);

    /* Loop forever responding to ranging requests. */
    int resp_number = 0;
    int waiting = 0;
    int setrxaftertx = 0;
    if (tx_resp_msg[3] == 0xAA) {
        printf("this is Anchor A");
        resp_number = 18;

        waiting = 600;
        waiting = 1200;
        setrxaftertx = 1550;
        ack_delay = 1;

    }
    else if (tx_resp_msg[3] == 0xBB) {
        printf("this is Anchor B");
        resp_number = 22;
        waiting = 900;
        waiting = 1800;
        setrxaftertx = 950;
        ack_delay = 2;
    }
    else if (tx_resp_msg[3] == 0xCC) {
        printf("this is Anchor C");
        resp_number = 26;

        waiting = 1350;
        waiting = 2700;
        setrxaftertx = 50;
        ack_delay = 3;
    }
    
    NRF_GPIO->DIRSET = 0x01 << 23;
    timer_init(1000);



    while (1)
    {
        dwt_setpreambledetecttimeout(0);
        /* Clear reception timeout to start next ranging process. */
        dwt_setrxtimeout(0);

        /* Activate reception immediately. */
        dwt_rxenable(DWT_START_RX_IMMEDIATE);

        /* Poll for reception of a frame or error/timeout. See NOTE 8 below. */
        while (!((status_reg = dwt_read32bitreg(SYS_STATUS_ID)) & (SYS_STATUS_RXFCG_BIT_MASK | SYS_STATUS_ALL_RX_TO | SYS_STATUS_ALL_RX_ERR)))
        {
        };

        if (status_reg & SYS_STATUS_RXFCG_BIT_MASK)
        {
            uint32_t frame_len;
            //printf(" \n receive poll");
            /* Clear good RX frame event in the DW IC status register. */
            dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_RXFCG_BIT_MASK);

            /* A frame has been received, read it into the local buffer. */
            frame_len = dwt_read32bitreg(RX_FINFO_ID) & FRAME_LEN_MAX_EX;
            if (frame_len <= RX_BUF_LEN)
            {
                dwt_readrxdata(rx_buffer, frame_len, 0);
            }
            //printf("frame_len = %d, ALL_MSG_COMMON_LEN = %d", frame_len, ALL_MSG_COMMON_LEN);

            /* Check that the frame is a poll sent by "DS TWR initiator" example.
             * As the sequence number field of the frame is not relevant, it is cleared to simplify the validation of the frame. */

            rx_buffer[ALL_MSG_SN_IDX] = 0;
            if (memcmp(rx_buffer, rx_poll_msg, ALL_MSG_COMMON_LEN) == 0)
            {
                uint32_t resp_tx_time;
                int ret;

                /* Retrieve poll reception timestamp. */
                poll_rx_ts = get_rx_timestamp_u64();

                /* Set send time for response. See NOTE 9 below. */
                resp_tx_time = (poll_rx_ts + ((waiting)*UUS_TO_DWT_TIME)) >> 8;
                dwt_setdelayedtrxtime(resp_tx_time);

                /* Set expected delay and timeout for final message reception. See NOTE 4 and 5 below. */
                dwt_setrxaftertxdelay(setrxaftertx);
                dwt_setrxtimeout(FINAL_RX_TIMEOUT_UUS);
                /* Set preamble timeout for expected frames. See NOTE 6 below. */
                dwt_setpreambledetecttimeout(PRE_TIMEOUT);

                /* Write and send the response message. See NOTE 10 below.*/
                //deca_sleep(waiting);
                //printf(" \n resp to TAG");
                tx_resp_msg[ALL_MSG_SN_IDX] = frame_seq_nb;
                dwt_writetxdata(sizeof(tx_resp_msg), tx_resp_msg, 0); /* Zero offset in TX buffer. */
                dwt_writetxfctrl(sizeof(tx_resp_msg), 0, 0); /* Zero offset in TX buffer, ranging. */
                ret = dwt_starttx(DWT_START_TX_DELAYED | DWT_RESPONSE_EXPECTED);

                /* If dwt_starttx() returns an error, abandon this ranging exchange and proceed to the next one. See NOTE 11 below. */
                if (ret == DWT_ERROR)
                {
                    continue;
                }

                /* Poll for reception of expected "final" frame or error/timeout. See NOTE 8 below. */
                while (!((status_reg = dwt_read32bitreg(SYS_STATUS_ID)) & (SYS_STATUS_RXFCG_BIT_MASK | SYS_STATUS_ALL_RX_TO | SYS_STATUS_ALL_RX_ERR)))
                {
                    //printf("\nreciev OK - waiting final");

                }



                /* Increment frame sequence number after transmission of the response message (modulo 256). */
                frame_seq_nb++;

                if (status_reg & SYS_STATUS_RXFCG_BIT_MASK)
                {
                    /* Clear good RX frame event and TX frame sent in the DW IC status register. */
                    dwt_write32bitreg(SYS_STATUS_ID, SYS_STATUS_RXFCG_BIT_MASK | SYS_STATUS_TXFRS_BIT_MASK);

                    /* A frame has been received, read it into the local buffer. */
                    frame_len = dwt_read32bitreg(RX_FINFO_ID) & FRAME_LEN_MAX_EX;
                    //printf("%d",frame_len);
                    if (frame_len <= RX_BUF_LEN_final)
                    {
                        dwt_readrxdata(rx_buffer_final, frame_len, 0);
                    }

                    /* Check that the frame is a final message sent by "DS TWR initiator" example.
                     * As the sequence number field of the frame is not used in this example, it can be zeroed to ease the validation of the frame. */
                    rx_buffer[ALL_MSG_SN_IDX] = 0;
                    //printf("\nrx_buffer len %d", frame_len);
                    uint32_t poll_tx_ts, final_tx_ts, resp_rx_A_ts, resp_rx_B_ts, resp_rx_C_ts;
                    //final_msg_get_ts(&rx_buffer_final[FINAL_MSG_POLL_TX_TS_IDX], &poll_tx_ts);
                    //final_msg_get_ts(&rx_buffer_final[FINAL_MSG_FINAL_TX_TS_IDX], &final_tx_ts);
                    //final_msg_get_ts(&rx_buffer_final[FINAL_MSG_RESP_A_RX_TS_IDX], &resp_rx_A_ts);
                    //final_msg_get_ts(&rx_buffer_final[FINAL_MSG_RESP_B_RX_TS_IDX], &resp_rx_B_ts);
                    //final_msg_get_ts(&rx_buffer_final[FINAL_MSG_RESP_C_RX_TS_IDX], &resp_rx_C_ts);

                    if ((memcmp(rx_buffer_final, rx_final_msg, 2) == 0) & (memcmp(rx_buffer_final + 5, rx_final_msg + 5, 5) == 0))
                    {
                        uint32_t poll_tx_ts, resp_rx_ts, final_tx_ts;
                        uint32_t poll_rx_ts_32, resp_tx_ts_32, final_rx_ts_32;
                        double Ra, Rb, Da, Db;
                        int64_t tof_dtu;

